
static int hello(int num) { // Объявление функции hello
// Она принимает аргумент num (целое число типа int) и возвращает это значение
    
    int result = num * 2; // Умножение значение num на 2

    
    return result; // Возвращение результата умножения
}

// В этом коде содержится функцию hello, которая получает целое число и возвращает удвоенное значение этого числа. (умножение на 2) 
// результат сохраняется в переменной result, затем это значение возвращается из функции с помощью return.